backend/controllers/RecipientListController.php

INSERT INTO `recipient_list` (`recipient_name`, `recipient_phone_number`, `group_id`) VALUES ('wer', '12345678902', 5)
---
    public function actionCreate()
    {
        /*  session "session_group_id" is created to get the currently selected user group by the user
            This was store in the RecipientListCOntroller -> acrionRecipient Fuction
        */
        $session_group_id = Yii::$app->session;
        $session_group_id->open();
        $currently_selected_group_id = $session_group_id['grou_id'];

        $model = new RecipientList();

        if ($model->load(Yii::$app->request->post())) {
            $model->group_id = $currently_selected_group_id;    //currently selected group id is automatically inserted into the recipient_list.group_id column in database
            $session_group_id->destroy();                       //'session_group_id' destroyed because it is not needed furthur more.
            $model->save();