backend/controllers/UserGroupController.php

INSERT INTO `user_group` (`group_name`, `group_owner_id`, `group_registration_date`) VALUES ('neighbours', 3, '2016-04-19 05:04:19')
---
    public function actionCreate()
    {
        $model = new UserGroup();

        if ($model->load(Yii::$app->request->post())) {
            $model->group_owner_id = Yii::$app->user->identity->id;
            $model->group_registration_date = date('Y-m-d h:m:s');
            $model->save();

SELECT * FROM `user_group` WHERE `group_id`='10'
---
    protected function findModel($id)
    {
        if (($model = UserGroup::findOne($id)) !== null) {